watcher/_posts/2016-12-26-My Rating System.html
---
title: My Rating System
tagline: What my rating number means
blog-category: watcher
major-mode: Meta
category:
- watcher
---

<div id="outline-container-org70d4546" class="outline-2">
<h2 id="org70d4546">What Is A Rating System?</h2>
<div class="outline-text-2" id="text-org70d4546">
<p>
In the context of watching stuff, <b>a rating system is a tool to
subjectively measure and communicate the value of the media.</b> I want
to stress <b>subjectively</b> because there is really no objective way of
viewing anything without bias. One can grade things like in school
with a number or a letter, one can rate things with a thumbs up or
down, once can rank things with a place on a list, one can average a
set of numbers, one can choose from many systems; ultimately, it
should be a tool of communication whether it be subjective or not.
(Honestly, there is no objective review but that's another post.)
</p>

<p>
No rating system is flawless as well since it is based on one's
current taste and preference. Where yesterday I liked it for visuals
but hated it today because it is outdated, one's taste grows and
matures over time so a constant reexamination is required and changed.
One moment <a href="https://en.wikipedia.org/wiki/Pluto">Pluto</a> was a planet, the next it is not; science is not
exact and so am I. So if you think my rating of a video is wrong,
remember it is just my take on it not yours which is ultimately
matters at the end of the day.
</p>

<p>
As a tool of communication, what I want to impart with my audience are
simply three things:
</p>

<ul class="org-ul">
<li>Whether you should watch it or not</li>
<li>What I think it is from a viewing experience</li>
<li>What it means for me as a person</li>
</ul>
</div>
</div>

<div id="outline-container-orge8b28a4" class="outline-2">
<h2 id="orge8b28a4">My Rating System</h2>
<div class="outline-text-2" id="text-orge8b28a4">
<p>
My rating simply is a scale of 1 to 5. Specifically, *one scale for the
casual viewer, one scale for my taste, and a note on what it means to
me* for a total of three scales of measure. I used to have a numeric scale of
1 to 10 but I realize it did not help me understand what I was
watching. Having only one numeric scale had the following problems:
</p>

<dl class="org-dl">
<dt>I can't say which films are easy and hard to watch</dt><dd>I give <a href="https://en.wikipedia.org/wiki/Angel%27s_Egg">Angel's Egg</a> and <a href="https://en.wikipedia.org/wiki/Song_of_the_Sea_%282014_film%29">Song of the Sea</a> the highest rating I can
give but the problem is that one film is very hard to watch from
a recommendation point of view. I would also give the art films
<a href="https://en.wikipedia.org/wiki/Enemy_(2013_film)">Enemy</a> and <a href="https://en.wikipedia.org/wiki/Under_the_Skin_(2013_film)">Under The Skin</a> the masterpiece rating but I can't
recommend it to a casual viewer but I can't give it a lower
rating just because it is hard to watch.</dd>
<dt>I can't separate my preference and bias</dt><dd>As with the <span class="underline">Star Wars</span> and <span class="underline">Studio Ghibli</span> franchise, I might
not be able to give a more objective point analysis since I am a
fanboy to both. So having two scales allows me to consider the
perspectives from which I am watching from.</dd>
<dt>I can't tell you what the rating really means for me</dt><dd>If it is just a number or letter, how can I convey my feelings
about the work in general? The film <a href="https://myanimelist.net/anime/32281/Kimi_no_Na_wa">Kimi no Na wa</a> is masterfully
done but I believe it is counter to everything done at that
point, a number or tier cannot say that.</dd>
</dl>

<p>
Those are my primary problems that's why I switched over. The third of
the scale is what this blog is for. My habit of watching films has led
to create a watch list where I put a solitary rating of my second
scale alone, so as an extension I will create a page indicating
everything I reviewed and analyzed so far. For now my numeric or
tiered scale of 1 to 5 can be described by the following description:
</p>

<dl class="org-dl">
<dt><b>5</b></dt><dd>A piece of art, should never be passed up</dd>
<dt><b>4</b></dt><dd>A good work, deserves praise and your time</dd>
<dt><b>3</b></dt><dd>A passable experience, good enough</dd>
<dt><b>2</b></dt><dd>A bad work, a lot of errors</dd>
<dt><b>1</b></dt><dd>Atrocious, a crime against humanity</dd>
</dl>

<p>
Not a mouthful, but that's pretty much how my scale works. I only
recommend a 4 or 5, but I rarely watch a 3 and below since I do
research on what good things I should watch and how I should watch it.
The descriptions themselves are vague but I have several points from
which I measure the overall quality:
</p>

<dl class="org-dl">
<dt><b>Visuals</b></dt><dd>Does the film look good? Important but not really drives my criteria</dd>
<dt><b>Plot / Story</b></dt><dd>Does it tell a good story? Which is what a movie should do in the
first place.</dd>
<dt><b>Characters</b></dt><dd>Are the characters compelling? I still like <a href="https://en.wikipedia.org/wiki/Coraline_(film)">Coraline Jones</a>
despite being mean spirited.</dd>
<dt><b>Cinematography</b></dt><dd>How is it filmed? I'm not an expert of but I can gauge a film's
quality by the number of shots, cuts and edits which shows
consideration, care and effort by the director</dd>
<dt><b>Execution</b></dt><dd>Is well done? The primary criteria. Even if it is dumb and
stupid, if it is well made; it is well made although I might not
like it.</dd>
<dt><b>Message / Theme</b></dt><dd>What is it saying? My secondary criteria. If it has a deeper
meaning than a medium, then it becomes a far better work but
execution is still king.</dd>
</dl>

<p>
Despite having multiple points, I don't put numbers on each one where
others average over them as there total; my problem with that is one
aspect could redeem the others despite being capped by a number. For
example, <a href="https://en.wikipedia.org/wiki/Kingsglaive:_Final_Fantasy_XV">Kingsglaive</a> is a 3 for me if not for the stellar animation
but I really don't like it still. So how do I put a overall number on
subjective scales? Enjoyment. Which is really a hard way to define
itself. If the film is depressing like <a href="https://en.wikipedia.org/wiki/Melancholia_%282011_film%29">Melancholia</a>, are you suppose to
rate the movie by fun or enjoyment or by the depressing or
intellectual catharsis? It is very nuanced indeed for art or uncommon
themes but most of the time I can gauge it based on the execution and
cinematography then by its enjoyment, meaning and message and my
reasons are written down for your judgment.
</p>

<p>
My own guideline on what rating it is if it follows what that rating
defines most of the time, I can argue about the pros and cons of the
media but what helps me simplify it is in tiers although that too can
be misplaced. I do want to stress my rating is not a review although
you might consider that, I prefer to do analysis instead since there
are so many of them. What I want others to tell me is how to watch the
film or how I can appreciate it further, not why I shouldn't watch it.
My first scale might be considered an watch approval, while the second
scale is my personal approval and the third my deeper analysis. In
short, I really like to think about them more than I want to watch
them and that's what I want to impart if I can.
</p>
</div>
</div>

<div id="outline-container-org2e7a6ab" class="outline-2">
<h2 id="org2e7a6ab">As A Rater</h2>
<div class="outline-text-2" id="text-org2e7a6ab">
<p>
I am more an intellectual than enjoyment viewer. I may cry on <a href="https://en.wikipedia.org/wiki/Inside_Out_(2015_film)">Inside
Out</a> but I am more stimulated by what it entails; I may laugh on <a href="https://en.wikipedia.org/wiki/Scott_Pilgrim">Scott
Pilgrim</a> but I am observing the scene transitions, use of effects and
respect on gamers; I have seen too many movies that I predict the
story first before actually watching. I have been spoiled.
</p>

<p>
I do have a secondary taste for animated or animation, such as
cartoons and animes since they allow for greater variety in color,
tone and setting. I like aesthetics more than graphics or maybe my
eyes are bored with a normal shot of a town. So I am a fanboy of
<span class="underline">Studio Ghibli</span>, <span class="underline">Cartoon Saloon</span>, <span class="underline">Makoto Shinkai</span>, <span class="underline">Satoshi Kon</span> and
so on. Color is such a nice thing.
</p>

<p>
Lastly, I don't like passable material, something that is neither good
nor bad. I constantly seek out and research approved and good
material. I don't watch on-going series or media because I want the
movie for what it is. Most of the time I go against the current media
and watch oldies such as black and whites and older anime. My
fundamental drive is that it must be good, and nothing is wasted more
on a movie that just wastes your time. Popcorn movies are not my thing
but I get a kick from time to time.
</p>
</div>
</div>

<div id="outline-container-orgc5d6d49" class="outline-2">
<h2 id="orgc5d6d49">At The End Of The Day</h2>
<div class="outline-text-2" id="text-orgc5d6d49">
<p>
It's just me explaining my feelings and thoughts on anything animated.
My ratings are not absolute and I merely here to offer my perspective,
not to rip apart your enjoyment but to simply respect your preference.
Whatever that form might be, I should be able to reason out and not
just say I feel like it. If I don't convey it properly, it is a
failure on my part. But I might be just spinning my wheel if I don't
analyze anything at all, so to test this out I will give my thoughts
on <a href="https://myanimelist.net/anime/32281/Kimi_no_Na_wa">Kimi no Na wa</a> for my next blog post.
</p>
</div>
</div>
